# Name Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyPointPlacementReference..::..Name Property
FamilyPointPlacementReference Class See Also
---
The name of the corresponding reference point in the Family document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string Name { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Name As String
	Get
```

Visual C++
---
```text
public:
property String^ Name {
	String^ get ();
}
```

# See Also
FamilyPointPlacementReference Class
Autodesk.Revit.DB Namespace